; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	satellite8 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	spectrograph3 - mode
	spectrograph4 - mode
	image0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star4)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument6 spectrograph4)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(supports instrument7 spectrograph4)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet6)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star3)
	(supports instrument10 image1)
	(supports instrument10 spectrograph3)
	(supports instrument10 image0)
	(calibration_target instrument10 Star0)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet9)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star2)
	(supports instrument12 image0)
	(supports instrument12 image1)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 Star3)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument13 spectrograph4)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 Star0)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet9)
	(supports instrument14 spectrograph3)
	(supports instrument14 image0)
	(supports instrument14 image1)
	(calibration_target instrument14 Star3)
	(supports instrument15 spectrograph4)
	(calibration_target instrument15 Star4)
	(supports instrument16 image0)
	(calibration_target instrument16 Star3)
	(on_board instrument14 satellite8)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star7)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite1 Planet6)
	(pointing satellite2 Planet5)
	(pointing satellite3 Star4)
	(pointing satellite4 Star0)
	(pointing satellite5 Star7)
	(pointing satellite6 Phenomenon8)
	(have_image Planet5 thermograph2)
	(have_image Planet6 image1)
	(have_image Star7 image0)
	(have_image Phenomenon8 spectrograph3)
	(have_image Planet9 thermograph2)
))

)

; plan
1. (turn_to satellite6 phenomenon8 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 phenomenon8)
   goals met: 2 of 12
2. (turn_to satellite5 star0 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 star0)
   goals met: 2 of 12
3. (switch_on instrument10 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument10)
   goals met: 2 of 12
4. (calibrate satellite5 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 2 of 12
5. (turn_to satellite5 phenomenon8 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 phenomenon8)
   goals met: 2 of 12
6. (turn_to satellite4 star0 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star0)
   goals met: 3 of 12
7. (turn_to satellite3 star4 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star4)
   goals met: 4 of 12
8. (turn_to satellite2 star4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star4)
   goals met: 4 of 12
9. (turn_to satellite1 planet6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet6)
   goals met: 5 of 12
10. (take_image satellite5 phenomenon8 instrument10 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 6 of 12
11. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 6 of 12
12. (calibrate satellite2 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 6 of 12
13. (turn_to satellite2 planet6 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet6)
   goals met: 6 of 12
14. (take_image satellite2 planet6 instrument2 image1)
   added: (have_image planet6 image1)
   goals met: 7 of 12
15. (turn_to satellite2 planet9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet9)
   goals met: 7 of 12
16. (take_image satellite2 planet9 instrument2 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 8 of 12
17. (turn_to satellite2 planet5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet5)
   goals met: 9 of 12
18. (take_image satellite2 planet5 instrument2 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 10 of 12
19. (turn_to satellite5 star7 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 star7)
   goals met: 11 of 12
20. (take_image satellite5 star7 instrument10 image0)
   added: (have_image star7 image0)
   goals met: 12 of 12
